zhanglazhuan/NomadCast/debug/t_speaker/sdkconfig.defaults
# Target chip (must be set before first build)
CONFIG_IDF_TARGET="esp32s3"

# USB Serial/JTAG as console (Leisound V1 doesn't use UART0)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# Leisound V1 has 16MB flash + 8MB PSRAM (ESP32-S3 WROOM N16R8)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=y

# FATFS (pulled in by default; configure to avoid build errors)
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_FATFS_API_ENCODING_UTF_8=y
CONFIG_FATFS_FS_LOCK=0
CONFIG_FATFS_TIMEOUT_MS=10000
CONFIG_FATFS_PER_FILE_CACHE=y
CONFIG_FATFS_USE_LABEL=y

CONFIG_ESP_LCD_ENABLE=n

# Legacy I2S driver: suppress deprecation warnings + enable debug log
CONFIG_I2S_SUPPRESS_DEPRECATE_WARN=y
CONFIG_I2S_ENABLE_DEBUG_LOG=y